---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotChangeInstFam
source: html/07555c77-afa6-a3cf-dead-c85b135e3305.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotChangeInstFam Property

Can't change Instance's Family. Try changing Instance's Host to a Level first.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotChangeInstFam { get; }
```